[{"Instructions":"This is a single line base.  Just use the Content, Image, and Heading Feilds.","Content":"> There are three different ways in which you can get involved in our ministry! You can pray, give, and go. All three play an important role as we minister in Thailand!\n\n### PRAY \n\n2 Corinthians 2:11 says \"Ye also helping together by prayer for us\". We ask that you would pray for our ministry here in Thailand. Language learning and cultural adaptation will be huge hurdles for us this year. You can stay up to date as how to pray for us by signing up for our email updates or following us via Facebook or Twitter!\n\n###  GIVE \n\nYou can also have a part in our ministry by financially supporting us on a monthly basis or with a one time love gift. \n\nYou can give online via Paypal through this link:\n\n[http://gbczachary.com/give-online/](http://gbczachary.com/give-online/) (our link is at the bottom of the page)\n\nOr you can send your donations to:\n\nGrace Baptist Church\n\nPO Box 532\n\nZachary, LA 70791\n\nPlease write Hernandez Family in the memo\n\n### GO \n\nIt is one thing to read about a foreign field, and it is another to experience it. Our eyes influence our hearts, and there is no better way to influence our lives for missions than through visiting a foreign field. The Lord used trips I was on to influence us on our way to Thailand!\n\nWe would be honored to host any individuals or groups that would like to visit Thailand. Feel free to contact us about this opportunity!","Page_Heading":"Get Involved","Featured_Image":[{"id":"attOjVKWCZYCaEIiK","url":"https://dl.airtable.com/r5boHcw6TfuoNzMrxmZB_13108773_1694944804093314_1105005222_n.jpg","filename":"13108773_1694944804093314_1105005222_n.jpg","size":96761,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/2dJcTxUGRMmjWlIZrjBV_small_13108773_1694944804093314_1105005222_n.jpg","width":68,"height":36},"large":{"url":"https://dl.airtable.com/aYzQ8sm6SCOqAzmdOfdp_large_13108773_1694944804093314_1105005222_n.jpg","width":512,"height":512}}}]}]
