[{"Name":"Ahmet","Content":"I was born and raised in a Christian home, where I trusted Jesus as my Lord and Saviour before the age of 10. But as I grew older, I drifted away from my heavenly Father and wasted many years of my life on things of the world. When I left the Navy in January of 2007, I ended up in the town of Zachary, Louisiana where I began attending Grace Baptist Church. It was under the preaching and teaching of Brother Tom that my wife and I heard the Lord’s call to missions for our family in June 2008. Since then, we have been preparing for the work that God had called us to. In July 2011, God revealed to us that He wanted us to go to Thailand. Looking back at our lives, we can see how God has prepared us for the work He has called us to in Thailand!","Image":[{"id":"attmpfrLZZyJu7tbe","url":"https://dl.airtable.com/rmwPdjcUQm2hdaQ8enD9_Ahmet.jpg","filename":"Ahmet.jpg","size":25617,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/5eX0v9IbTXKOSGqazpwT_small_Ahmet.jpg","width":53,"height":36},"large":{"url":"https://dl.airtable.com/hYT8TFIeQhGRKgHMzDaG_large_Ahmet.jpg","width":300,"height":204}}}]},{"Name":"Rachel","Content":"I do not ever remember a time when I did not believe in God. When I would ride my bike, I would look up in the clouds and imagine Jesus coming back. Only, He was on surf board. (I’m from Pensacola! What can I say!) However, it wasn’t until right after we got married that I trusted Jesus as my Lord and Saviour. Since then, I have been tested and tried and my faith has grown and grown.</p>\n                    <p>While stationed in Guam, we attended a church started by missionaries and I used to think, “There is no way I could do that.” Well, in June of 2008, God called both my husband and me to a life beyond sitting in the pew. What a joy! He has been faithful to guide us each step of the way.","Image":[{"id":"attgTg8NIeNOEuYy3","url":"https://dl.airtable.com/hCySwf9hSNOHBIIhD11E_Rachael.jpg","filename":"Rachael.jpg","size":24529,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/V0Am9606SNiQl5dUhx2x_small_Rachael.jpg","width":53,"height":36},"large":{"url":"https://dl.airtable.com/UTipNUb2SbGgt9ehmT0H_large_Rachael.jpg","width":300,"height":204}}}]}]
