[{"title":"July 2016 update","body_content":"Dear Praying Friends and Family \n\nI know it sounds impossible, but the second month of Hua Mak Baptist Church was more exciting for me than the first! God is doing some awesome things already and we are excited about the future. Some of the blessings I want to share are:\n\n* Wednesday night discipleship/Bible study - I am teaching this in Thai and so far it is great. It is a good challenge for me to prepare a lesson plan. It is a greater challenge when they ask me questions I have not prepared for! We already have a core group of 4 young men coming to this.\n* Taking responsibility - We have 5 young men that are looking for ways to serve. One of the blessings of our community night was that they started sweeping, mopping, scrubbing toilets, washing dishes, etc. without me asking them. Three of these young men have also already brought visitors to church. It is awesome to see God building a servants heart in each of them.\n* Planned baptism service next month - The first 2 young men saved want to be baptized so we plan on having our first in August. \n* Community night - We hold monthly events to get to know people who are not yet comfortable coming to a church service or learning English. We made 6 new contacts through this.\n* Building - Currently we have our building rent free until October. However, the owner is considering selling the building. We are not sure what will happen in this situation, but please pray for wisdom and provision from God. \n\nAlso this month we were able to have our non-profit visa renewed for 6 months. This means we are good until January 2017. The ultimate goal is to receive a missionary visa, but I need to pass the Thai government language exam this November for this to proceed. Please pray as I prepare for this test.\n\nMy wife and kids are spending a few weeks in America this month to tend to some different things. Pray for their safety as they take care of errands and visit many friends and family!\n\nThank you for your faithful prayers and support!\n\nYour Fellow Laborers,\nThe Hernandez Family","featured_image":[{"id":"attqfp8hj6UeIOPnx","url":"https://dl.airtable.com/IbyHsEMKRguKZLVu4l2n_First%20Services.jpg","filename":"First Services.jpg","size":904824,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/WnNutbsSSeSnRUzVd0rw_small_First%20Services.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/NxmqihTAmpplhm3HYqtA_large_First%20Services.jpg","width":512,"height":512}}}],"date":"2016-07-24","prayer_letter":[{"id":"attsRVtasGYyHkbhU","url":"https://dl.airtable.com/bIIFBnHQoCfnpqdfKlcw_July%202016%20PL.pdf","filename":"July 2016 PL.pdf","size":1854914,"type":"application/pdf","thumbnails":{"small":{"url":"https://dl.airtable.com/attsRVtasGYyHkbhU-28x36.png","width":28,"height":36},"large":{"url":"https://dl.airtable.com/attsRVtasGYyHkbhU-512x663.png","width":512,"height":663}}}],"published":true,"prayer_requests":"* Services at Hua Mak\n\t* Visitors\n\t* Salvations\n\t* Discipleship\n\t* Outreaches\n* November language exam\n* Increased financial support\n* Building situation"},{"title":"May 2016 update","body_content":"April showers bring May flowers-but not here in Thailand! The news says this has been the hottest April inThailand for 65 years, and we have no doubt they are correct. With much of the country being in a state of drought, the heat has seemed even more intense. Please pray for Thailand’s weather and the impact it has on its economy. A drought means no rice farming, and without the ability to plant rice, many people will suffer financially.\n\n## Visa Update\n\nWe were able to extend our visa for one more month. The plan is at the end of next month, we should receive our one-year visa, and then this becomes a yearly process, with online check-ins every three months. We were not too surprised by the one month extension, but we were surprised at having to re-do all our paperwork. It seems the rules are always changing, and we never know which ones apply!\n\n## English-Bible Camp\n\nThe camp was a lot of fun! We had a total of 23 students come, and many of them were new students. The camp was for 3 days, and with a special ceremony on Thursday night. The kids sang songs and said sentences they had learned. They also quoted Genesis 1:1 in Thai. There were only two parents that came, but they were as sweet as can be! Through the camp, we saw God grow our connections in the community, and have noticed an increase in interest in the student center and the church.\n\n## Hua Mak Baptist Church\n\nThe first service is our most exciting up-coming event! During May we will get the basics for the kitchen set up, find English Bibles, order hymnals, do some extra cleaning, and hand out as many flyers as possible! Our camp students handed out a bunch last week, and we were quite thankful for the help!\nWith much prayer, we have decided to have separate English and Thai services. Where the church is located is a very international area (because of the college) and offering two services will allow us to minister to both groups. An interesting twist to the location is that the college is a Catholic college, and there are many nuns who live around the church. Therefore, the Thai people in the area have no idea what a true Christian church looks like, or what the real Gospel is, and we are thrilled to be able to tell them!","featured_image":[{"id":"att7upkNWelx6a2v2","url":"https://dl.airtable.com/HByNAyWWQAuqpwhQeTml_Getting%20Ready.jpg","filename":"Getting Ready.jpg","size":724157,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/JtxiEtW9SRiUGepYelEA_small_Getting%20Ready.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/qmG2WmX1TbGvZ7F10MVj_large_Getting%20Ready.jpg","width":512,"height":512}}}],"date":"2016-05-16","prayer_letter":[{"id":"attisztoreA2OJ6xM","url":"https://dl.airtable.com/xeGyBRvSYCBeC7BXYejd_May%202016%20PL%20(1).pdf","filename":"May 2016 PL (1).pdf","size":1852311,"type":"application/pdf","thumbnails":{"small":{"url":"https://dl.airtable.com/attisztoreA2OJ6xM-28x36.png","width":28,"height":36},"large":{"url":"https://dl.airtable.com/attisztoreA2OJ6xM-512x663.png","width":512,"height":663}}}],"published":true,"prayer_requests":"* First service to launch on June 5th! \n\t* Visitors \n\t* Salvations \n\t* Discipleship \n\t* Getting the property ready \n* Continued progress in our language studies "},{"title":"March/April 2016 update","body_content":"1 Thessalonians 2:13 says\n\n> *“For this cause also thank we God without ceasing, because, when ye received the word of God which ye heard of us, ye received it not as the word of men, but as it is in truth, the word of God, which effectually worketh also in you that believe.”*\n\nEveryday we hand out tracts, take opportunities to talk about Jesus, and if given the chance, we give the Gospel. Yet, we are painfully aware that often our words are seen as just — words. We know the Gospel is the power of God unto salvation, so they really are not just words, and we are confident God is working in the hearts of people we meet. But sometimes, the look in their eyes tells us they do no understand. That “look” has pushed us to rely more and more on God, and allowed us to see that it is the work of the Holy Spirit, and the power of the prayers of God’s people, that opens hearts to receive the Gospel-not as words of men, but as the Word of God.\nWe apologize for the delay in getting this letter out to you. There have been many changes happening, and we decided to wait to send this once we had a clearer picture of what our near future will look like.\n\n### But first, a quick summary of February!\n\nFebruary was a great month, even if it was filled with several trips to the doctor. Ahmet was sick, Aj broke his finger, and Little Rachel scraped her knee up quite badly when she fell off her bike. Everyone is healed now, and doing much better! We also celebrated 14 years of marriage in February. Granted, half the day was spent at doctor appointments, and the other half was spent at school, but we did sneak in a yummy Mexican lunch!\n\nThe girls enjoyed their first month of going to language school every day, but it really hurt their regular school. Therefore, they will not be going back until the regular school year is finished. However, we did find a tutor who will come to our house to teach Rachael and the kids.\n\nOur friends, the Bassham’s, were able to rent a building to start a church plant this coming summer. We are excited for them, and excited about getting to help out in any way possible. For now, we are teaching English with them, and getting information out to the neighborhood.\n\n### What’s coming up:\n\nNear the end of deputation, our pastor said missions is more about God working and letting us in on the action, than it is about us going to do a work for God. We have kept that tucked into our heart, and often prayed together asking the Lord to just plug us in wherever He was already working. God has been faithful to provide many ways to serve, and we are excited about this newest opportunity.\n\nAbout 6 months ago, Brother Ricky Salmon was given a building near the ABAC college campus by a Christian who wanted it to be used for the Lord. This is where we currently teach English classes- we teach English for an hour and the Bible for 30 minutes. However, God has led Ricky and I to begin church services there as well. After counseling with my pastor, we have decided to start church services in June! This is not a decision we have taken lightly, because we know this is a huge time and financial commitment. Learning Thai is still a priority, because I still believe to reach the Thai people, you must speak Thai, and speak it well.\n\nObviously there are many challenges up ahead, but we are excited and humbled to be used of God in this capacity. A an extra blessing for us is that we get to do this under a veteran missionary. We will be able to draw from his experience and knowledge of the culture and people.\n\nOver the next few months, we will be getting out more flyers to the area, do some work on the building, hold a English Bible club for the kids during their school holiday, and many other things to reach the community. Even though we will be doing things to increase our presence in the community, it is comforting that it isn't me, but Jesus Christ through the Holy Spirt, who will build His church! Please be in prayer for us!\n\nYour Fellow Laborers The Hernandez Family","date":"2016-04-30","prayer_letter":[{"id":"attawwiyVnAX4AwJe","url":"https://dl.airtable.com/HABDgOeYR4GuS56zFYYF_March-April%202016%20PL.pdf","filename":"March-April 2016 PL.pdf","size":1876703,"type":"application/pdf","thumbnails":{"small":{"url":"https://dl.airtable.com/attawwiyVnAX4AwJe-28x36.png","width":28,"height":36},"large":{"url":"https://dl.airtable.com/attawwiyVnAX4AwJe-512x663.png","width":512,"height":663}}}],"published":true,"prayer_requests":"* First service to launch on June 5th!\n\t* Visitors\n\t* Salvations\n\t* Discipleship\n* Upcoming children’s English club\n* Continued progress in our language studies"}]
